tap "encoredev/tap"
tap "github/gh"
tap "mongodb/brew"

brew "ack"
brew "automake"
brew "bash"
brew "brew-gem"
brew "cargo-binstall"
brew "cargo-outdated"
brew "coreutils"
brew "curl"
brew "deno"
brew "direnv"
brew "elvish"
brew "encore"
brew "freeze"
brew "fx"
brew "hurl"
brew "git"
brew "git-lfs"
brew "asdf"
brew "glib"
brew "gcc"
brew "gnu-sed"
brew "jaq"
brew "jd"
brew "jo"
brew "jq"
brew "jql"
brew "libtool"
brew "lla"
brew "lua"
brew "netlify-cli"
brew "openssl@3"
brew "ruby"
brew "gh"
brew "hub"
brew "pipx"
brew "python@3.11"
brew "pyenv"
brew "imagemagick"
brew "node"
brew "php"
brew "wget"

brew "bandwhich"
brew "bat"
brew "bottom"
brew "dust"
brew "eza"
brew "fd"
brew "procs"
brew "ripgrep"
brew "tokei"

cask "1password-cli"
cask "antinote"
cask "font-abel"
cask "font-aporetic"
cask "font-atkinson-hyperlegible"
cask "font-atkinson-hyperlegible-mono"
cask "font-atkinson-hyperlegible-next"
cask "font-bakbak-one"
cask "font-boldonse"
cask "font-cascadia-code-nf"
cask "font-cascadia-mono-nf"
cask "font-gd-highwaygothicja"
cask "font-google-sans-code"
cask "font-iosevka"
cask "font-iosevka-aile"
cask "font-iosevka-curly"
cask "font-iosevka-curly-slab"
cask "font-jetbrains-mono"
cask "font-monaspace"
cask "font-monoid"
cask "font-noto-sans"
cask "font-open-sans"
cask "font-oswald"
cask "font-oxygen"
cask "font-podkova"
cask "font-poppins"
cask "font-recursive"
cask "font-roboto"
cask "font-roboto-flex"
cask "font-roboto-mono"
cask "font-roboto-slab"
cask "font-source-code-pro"
cask "font-source-sans-3"
cask "font-space-mono"
cask "font-victor-mono"
cask "graphql-playground"
cask "llamachat"
cask "ghostty"
cask "macdown"
cask "podman-desktop"
cask "qlimagesize"
cask "wave"
cask "webpquicklook"

brew "charmbracelet/tap/charm"
brew "charmbracelet/tap/crush"
brew "charmbracelet/tap/glow"
brew "charmbracelet/tap/gum"
brew "charmbracelet/tap/mods"
brew "charmbracelet/tap/pop"
brew "charmbracelet/tap/sequin"
brew "charmbracelet/tap/skate"
brew "charmbracelet/tap/soft-serve"
brew "charmbracelet/tap/vhs"
brew "tidwall/jj/jj"