tap "encoredev/tap"
tap "github/gh"
tap "homebrew/bundle"
tap "mongodb/brew"
tap "charmbracelet/tap"
tap "tidwall/jj"
brew "ack"
brew "automake"
brew "bash"
brew "brew-gem"
brew "coreutils"
brew "curl"
brew "deno"
brew "direnv"
brew "elvish"
brew "encore"
brew "freeze"
brew "hurl"
brew "git"
brew "git-lfs"
brew "asdf"
brew "glib"
brew "gcc"
brew "jaq"
brew "jd"
brew "jj"
brew "jo"
brew "jq"
brew "jql"
brew "libtool"
brew "netlify-cli"
brew "openssl@3"
brew "ruby"
brew "gh"
brew "hub"
brew "pipx"
brew "python@3.11"
brew "pyenv"
brew "imagemagick"
brew "node"
brew "n"
brew "nvm"
brew "php"
brew "wget"
brew "yarn"
cask "1password-cli"
cask "font-abel"
cask "font-bakbak-one"
cask "font-cascadia-code-nf"
cask "font-cascadia-mono-nf"
cask "font-jetbrains-mono"
cask "font-monaspace"
cask "font-monoid"
cask "font-noto-sans"
cask "font-open-sans"
cask "font-oswald"
cask "font-oxygen"
cask "font-poppins"
cask "font-roboto"
cask "font-roboto-flex"
cask "font-roboto-mono"
cask "font-roboto-slab"
cask "font-source-code-pro"
cask "font-source-sans-3"
cask "font-space-mono"
cask "font-victor-mono"
cask "graphql-playground"
cask "llamachat"
cask "macdown"
cask "qlimagesize"
cask "wave"
cask "webpquicklook"
