tap "encoredev/tap"
tap "github/gh"
tap "mongodb/brew"
tap "misterTea/et"
tap "productdevbook/tap"
# tap "sinelaw/fresh"
tap "steipete/tap"
tap "steveyegge/beads"
tap "wedow/tools"

brew "ack"
brew "automake"
brew "bash"
brew "brew-gem"
# brew "cargo-binstall"
# brew "cargo-outdated"
brew "coreutils"
brew "curl"
brew "direnv"
brew "elvish"
brew "encore"
brew "freeze"
brew "fx"
brew "hurl"
brew "git"
brew "git-lfs"
brew "asdf"
brew "glib"
brew "gcc"
brew "gnu-sed"
brew "jaq"
brew "jc"
brew "jd"
brew "jo"
brew "jq"
brew "jql"
brew "libtool"
brew "lla"
brew "lua"
brew "luajit"
brew "mise"
# brew "netlify-cli"
brew "openssl@3"
brew "ruby"

# task tools for agents
# brew "bd"
# brew "ticket"

brew "gh"
brew "hub"
brew "make"
# brew "pipx"
# brew "python@3.11"
# brew "pyenv"
# brew "uv"
brew "imagemagick"
brew "node"
brew "php"
brew "wget"

brew "amp"
brew "cmake"
brew "et"
brew "fresh-editor"
brew "helix"
brew "mdserve"
brew "mg"
brew "micro"
brew "mole"
brew "mosh"
brew "neovim"
brew "ox"
brew "shfmt"
brew "tmux"
brew "tree"
brew "vim"

brew "bandwhich"
brew "bat"
brew "bottom"
brew "dust"
brew "eza"
brew "fd"
brew "oxfmt"
brew "pake"
brew "procs"
brew "ripgrep"
brew "tokei"

brew "mprocs"
brew "ntfy"
brew "ots"
brew "qrcp"

cask "1password-cli"
cask "antinote"
cask "opcode"

cask "font-abel"
cask "font-amarna"
cask "font-aporetic"
cask "font-atkinson-hyperlegible"
cask "font-atkinson-hyperlegible-mono"
cask "font-atkinson-hyperlegible-next"
cask "font-bakbak-one"
cask "font-boldonse"
cask "font-cascadia-code-nf"
cask "font-cascadia-mono-nf"
cask "font-commit-mono-nerd-font"
cask "font-datatype"
cask "font-dejavu-sans"
cask "font-departure-mono"
cask "font-gd-highwaygothicja"
cask "font-geom"
cask "font-google-sans-code"
cask "font-guguru-sans-code"
cask "font-guguru-sans-code-nf"
cask "font-iosevka"
cask "font-iosevka-aile"
cask "font-iosevka-charon"
cask "font-iosevka-charon-mono"
cask "font-iosevka-curly"
cask "font-iosevka-curly-slab"
cask "font-jetbrains-mono"
cask "font-line-seed-jp"
cask "font-maple-mono"
cask "font-maple-mono-nf"
cask "font-monaspace"
cask "font-monoid"
cask "font-noto-sans"
cask "font-open-sans"
cask "font-oswald"
cask "font-oxygen"
cask "font-podkova"
cask "font-poppins"
cask "font-recursive"
cask "font-roboto"
cask "font-roboto-flex"
cask "font-roboto-mono"
cask "font-roboto-slab"
cask "font-source-code-pro"
cask "font-source-sans-3"
cask "font-space-mono"
cask "font-victor-mono"

cask "codexbar"
cask "portkiller"
cask "repobar"

cask "ghostty"
cask "graphql-playground"
cask "llamachat"
cask "macdown"
cask "podman-desktop"
cask "wave"

cask "qlimagesize"
cask "webpquicklook"

brew "charmbracelet/tap/charm"
brew "charmbracelet/tap/crush"
brew "charmbracelet/tap/glow"
brew "charmbracelet/tap/gum"
brew "charmbracelet/tap/mods"
brew "charmbracelet/tap/pop"
brew "charmbracelet/tap/sequin"
brew "charmbracelet/tap/skate"
brew "charmbracelet/tap/soft-serve"
brew "charmbracelet/tap/vhs"
brew "ksdme/tap/ut"
brew "tidwall/jj/jj"
brew "f/mcptools/mcp"

